perf-testing/3.x/oauth/oauth-3x.log
Gateway Benchmark Results - RHOAI 3.x with OAuth
Generated: Wed Oct 15 10:34:51 AM CDT 2025
Configuration: 10000 requests, 50 concurrency, 5 iterations
Gateway URL: https://data-science-gateway.apps.rosa.b9q3t4p8k3y8k9a.vzrg.p3.openshiftapps.com/echo

================================================================================

=== ITERATION 1 ===
Started: Wed Oct 15 10:35:17 AM CDT 2025


Summary:
  Total:	523.9947 secs
  Slowest:	3.0037 secs
  Fastest:	0.2120 secs
  Average:	2.6136 secs
  Requests/sec:	19.0842
  
  Total data:	49470000 bytes
  Size/request:	4947 bytes

Response time histogram:
  0.212 [1]	|
  0.491 [4]	|
  0.770 [6]	|
  1.049 [5]	|
  1.329 [6]	|
  1.608 [6]	|
  1.887 [4]	|
  2.166 [4]	|
  2.445 [9]	|
  2.724 [9084]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.004 [871]	|■■■■


Latency distribution:
  10% in 2.5324 secs
  25% in 2.5640 secs
  50% in 2.6060 secs
  75% in 2.6660 secs
  90% in 2.7180 secs
  95% in 2.7535 secs
  99% in 2.8299 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.2120 secs, 3.0037 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0020 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0014 secs
  resp wait:	2.6129 secs, 0.1198 secs, 3.0034 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0137 secs

Status code distribution:
  [200]	10000 responses



Completed: Wed Oct 15 10:44:03 AM CDT 2025

--------------------------------------------------------------------------------

=== ITERATION 2 ===
Started: Wed Oct 15 10:44:13 AM CDT 2025


Summary:
  Total:	532.8996 secs
  Slowest:	3.6691 secs
  Fastest:	0.2759 secs
  Average:	2.6579 secs
  Requests/sec:	18.7653
  
  Total data:	49470000 bytes
  Size/request:	4947 bytes

Response time histogram:
  0.276 [1]	|
  0.615 [5]	|
  0.955 [5]	|
  1.294 [6]	|
  1.633 [6]	|
  1.972 [6]	|
  2.312 [7]	|
  2.651 [5449]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.990 [4279]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.330 [178]	|■
  3.669 [58]	|


Latency distribution:
  10% in 2.5461 secs
  25% in 2.5875 secs
  50% in 2.6422 secs
  75% in 2.7011 secs
  90% in 2.7698 secs
  95% in 2.8263 secs
  99% in 3.2003 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0008 secs, 0.2759 secs, 3.6691 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0451 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	2.6570 secs, 0.1377 secs, 3.6689 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0027 secs

Status code distribution:
  [200]	10000 responses



Completed: Wed Oct 15 10:53:08 AM CDT 2025

--------------------------------------------------------------------------------

=== ITERATION 3 ===
Started: Wed Oct 15 10:53:18 AM CDT 2025


Summary:
  Total:	531.0355 secs
  Slowest:	3.0519 secs
  Fastest:	0.2655 secs
  Average:	2.6486 secs
  Requests/sec:	18.8311
  
  Total data:	49470000 bytes
  Size/request:	4947 bytes

Response time histogram:
  0.265 [1]	|
  0.544 [4]	|
  0.823 [5]	|
  1.101 [5]	|
  1.380 [6]	|
  1.659 [5]	|
  1.937 [6]	|
  2.216 [5]	|
  2.495 [15]	|
  2.773 [9038]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.052 [910]	|■■■■


Latency distribution:
  10% in 2.5548 secs
  25% in 2.5901 secs
  50% in 2.6427 secs
  75% in 2.6976 secs
  90% in 2.7658 secs
  95% in 2.8098 secs
  99% in 2.9317 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0008 secs, 0.2655 secs, 3.0519 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0566 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0009 secs
  resp wait:	2.6476 secs, 0.1185 secs, 3.0518 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0022 secs

Status code distribution:
  [200]	10000 responses



Completed: Wed Oct 15 11:02:11 AM CDT 2025

--------------------------------------------------------------------------------

=== ITERATION 4 ===
Started: Wed Oct 15 11:02:21 AM CDT 2025


Summary:
  Total:	533.6848 secs
  Slowest:	3.7686 secs
  Fastest:	0.2647 secs
  Average:	2.6620 secs
  Requests/sec:	18.7377
  
  Total data:	49470000 bytes
  Size/request:	4947 bytes

Response time histogram:
  0.265 [1]	|
  0.615 [6]	|
  0.966 [7]	|
  1.316 [7]	|
  1.666 [7]	|
  2.017 [7]	|
  2.367 [6]	|
  2.717 [7820]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.068 [2033]	|■■■■■■■■■■
  3.418 [6]	|
  3.769 [100]	|■


Latency distribution:
  10% in 2.5668 secs
  25% in 2.5989 secs
  50% in 2.6465 secs
  75% in 2.7060 secs
  90% in 2.7704 secs
  95% in 2.8191 secs
  99% in 3.4856 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0008 secs, 0.2647 secs, 3.7686 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0498 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	2.6610 secs, 0.1235 secs, 3.7684 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0043 secs

Status code distribution:
  [200]	10000 responses



Completed: Wed Oct 15 11:11:17 AM CDT 2025

--------------------------------------------------------------------------------

=== ITERATION 5 ===
Started: Wed Oct 15 11:11:27 AM CDT 2025


Summary:
  Total:	600.2566 secs
  Slowest:	17.7556 secs
  Fastest:	0.2590 secs
  Average:	2.8004 secs
  Requests/sec:	16.6595
  
  Total data:	48910989 bytes
  Size/request:	4947 bytes

Response time histogram:
  0.259 [1]	|
  2.009 [34]	|
  3.758 [9715]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  5.508 [0]	|
  7.258 [0]	|
  9.007 [0]	|
  10.757 [13]	|
  12.507 [6]	|
  14.256 [67]	|
  16.006 [28]	|
  17.756 [23]	|


Latency distribution:
  10% in 2.5583 secs
  25% in 2.5897 secs
  50% in 2.6380 secs
  75% in 2.6900 secs
  90% in 2.7551 secs
  95% in 2.8113 secs
  99% in 12.5513 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0014 secs, 0.2590 secs, 17.7556 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0459 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0011 secs
  resp wait:	2.7988 secs, 0.1190 secs, 17.6581 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0040 secs

Status code distribution:
  [200]	9887 responses

Error distribution:
  [113]	Get "https://data-science-gateway.apps.rosa.b9q3t4p8k3y8k9a.vzrg.p3.openshiftapps.com/echo": context deadline exceeded (Client.Timeout exceeded while awaiting headers)


Completed: Wed Oct 15 11:21:29 AM CDT 2025

--------------------------------------------------------------------------------